Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectAttributes Class
 The EmbeddedObjectAttributes class contains attributes for embedded objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.EmbeddedObjectAttributes
 Tekla.Structures.Drawing.TextFile.TextFileAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class EmbeddedObjectAttributes : AttributesBase
<SerializableAttribute>
Public Class EmbeddedObjectAttributes
	Inherits AttributesBase
The EmbeddedObjectAttributes type exposes the following members.
Constructors
Name | Description
EmbeddedObjectAttributes()
 Initializes a new instance of the EmbeddedObjectAttributes class that loads standard attributes.
EmbeddedObjectAttributes(String)
 Initializes a new instance of the EmbeddedObjectAttributes class that loads given attributes.
Top
Properties
Name | Description
Frame
 Gets or sets the frame.
Scaling
 Gets or sets the scaling type.
XScale
 Gets or sets the X scaling value. Changing this property will set the scaling type to ScaleXY.
YScale
 Gets or sets the Y scaling value. Changing this property will set the scaling type to ScaleXY.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the specified attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace
Tekla.Structures.Drawing.EmbeddedObjectBase